Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0032GPL028.atdf
      <value-group caption="AN4 Pin Scan Selection bits" name="AD1CSS__CSS4">
         <value caption="Select AN4 for input scan; CSS4 = AN4" name="" value="0x1" />
         <value caption="Skip AN4 for input scan; CSS4 = AN4" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Pin Scan Selection bits" name="AD1CSS__CSS5">
         <value caption="Select AN5 for input scan; CSS5 = AN5" name="" value="0x1" />
         <value caption="Skip AN5 for input scan; CSS5 = AN5" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Pin Scan Selection bits" name="AD1CSS__CSS6">
         <value caption="Select AN6 for input scan; CSS6 = AN6" name="" value="0x1" />
         <value caption="Skip AN6 for input scan; CSS6 = AN6" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Pin Scan Selection bits" name="AD1CSS__CSS7">
         <value caption="Select AN7 for input scan; CSS7 = AN7" name="" value="0x1" />
         <value caption="Skip AN7 for input scan; CSS7 = AN7" name="" value="0x0" />
      </value-group>
      <value-group caption="AN8 Pin Scan Selection bits" name="AD1CSS__CSS8">
         <value caption="Select AN8 for input scan; CSS8 = AN8" name="" value="0x1" />
         <value caption="Skip AN8 for input scan; CSS8 = AN8" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Pin Scan Selection bits" name="AD1CSS__CSS9">
         <value caption="Select AN9 for input scan; CSS9 = AN9" name="" value="0x1" />
         <value caption="Skip AN9 for input scan; CSS9 = AN9" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Pin Scan Selection bits" name="AD1CSS__CSS10">
         <value caption="Select AN10 for input scan; CSS10 = AN10" name="" value="0x1" />
         <value caption="Skip AN10 for input scan; CSS10 = AN10" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Pin Scan Selection bits" name="AD1CSS__CSS11">
         <value caption="Select AN11 for input scan; CSS11 = AN11" name="" value="0x1" />
         <value caption="Skip AN11 for input scan; CSS11 = AN11" name="" value="0x0" />
      </value-group>
      <value-group caption="AN12 Pin Scan Selection bits" name="AD1CSS__CSS12">
         <value caption="Select AN12 for input scan; CSS12 = AN12" name="" value="0x00001000" />
         <value caption="Skip AN12 for input scan; CSS12 = AN12" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Pin Scan Selection bits" name="AD1CSS__CSS13">
         <value caption="Select AN13 for input scan; CSS13 = AN13" name="" value="0x00002000" />
         <value caption="Skip AN13 for input scan; CSS13 = AN13" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Pin Scan Selection bits" name="AD1CSS__CSS14">
         <value caption="Select AN14 for input scan; CSS14 = AN14" name="" value="0x00004000" />
         <value caption="Skip AN14 for input scan; CSS14 = AN14" name="" value="0x0" />
      </value-group>
      <value-group caption="AN15 Pin Scan Selection bits" name="AD1CSS__CSS15">
         <value caption="Select AN15 for input scan; CSS15 = AN15" name="" value="0x00008000" />
         <value caption="Skip AN15 for input scan; CSS15 = AN15" name="" value="0x0" />
      </value-group>
      <value-group caption="AN16 Pin Scan Selection bits" name="AD1CSS__CSS16">
         <value caption="Select AN16 for input scan; CSS16 = AN16" name="" value="0x10000" />
         <value caption="Skip AN16 for input scan; CSS16 = AN16" name="" value="0x0" />
      </value-group>
      <value-group caption="AN17 Pin Scan Selection bits" name="AD1CSS__CSS17">
         <value caption="Select AN17 for input scan; CSS17 = AN17" name="" value="0x20000" />
         <value caption="Skip AN17 for input scan; CSS17 = AN17" name="" value="0x0" />
      </value-group>
      <value-group caption="AN18 Pin Scan Selection bits" name="AD1CSS__CSS18">
         <value caption="Select AN18 for input scan; CSS18 = AN18" name="" value="0x40000" />
         <value caption="Skip AN18 for input scan; CSS18 = AN18" name="" value="0x0" />
      </value-group>
      <value-group caption="AN19 Pin Scan Selection bits" name="AD1CSS__CSS19">
         <value caption="Select AN19 for input scan; CSS19 = AN19" name="" value="0x80000" />
         <value caption="Skip AN19 for input scan; CSS19 = AN19" name="" value="0x0" />
      </value-group>
      <value-group caption="VDDCORE Scan Selection bits" name="AD1CSS__CSS27">
         <value caption="Select VDDCORE for input scan; CSS27 = VDDCORE" name="" value="0x8000000" />
         <value caption="Skip VDDCORE for input scan; CSS27 = VDDCORE" name="" value="0x0" />
      </value-group>
      <value-group caption="VBG Scan Selection bits" name="AD1CSS__CSS28">
         <value caption="Select VBG for input scan; CSS28 = VBG" name="" value="0x1" />
         <value caption="Skip VBG for input scan; CSS28 = VBG" name="" value="0x0" />
      </value-group>
      <value-group caption="AVSS Scan Selection bits" name="AD1CSS__CSS29">
         <value caption="Select AVSS for input scan; CSS29 = AVSS" name="" value="0x1" />
         <value caption="Skip AVSS for input scan; CSS29 = AVSS" name="" value="0x0" />
      </value-group>
      <value-group caption="AVDD Scan Selection bits" name="AD1CSS__CSS30">
         <value caption="Select AVDD for input scan; CSS30 = AVDD" name="" value="0x1" />
         <value caption="Skip AVDD for input scan; CSS30 = AVDD" name="" value="0x0" />
      </value-group>
      <value-group caption="Compare mode bits" name="AD1CON5__CM">
         <value caption="Outside Window mode" name="" value="0x3" />
         <value caption="Inside Window mode" name="" value="0x2" />
         <value caption="Greater Than mode" name="" value="0x1" />
         <value caption="Less Than mode" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01512" name="CCP" version="">
      <register-group name="CCP">
         <register caption="" name="CCP1CON1" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCPCON1__TMRPS"/>
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP1CON1__CLKSEL"/>
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP1CON1__SYNC"/>
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP1CON1__OPS"/>
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
