Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0032GPL028.atdf
      <value-group caption="CCPx Auto shutdown / Gate Mode Enable" name="CCP1CON2__ASDGM">
         <value caption="Shutdown event occurs immediately" name="" value="0x0" />
         <value caption="Waits until the next time base reset or rollover" name="" value="0x1" />
      </value-group>
      <value-group caption="PWMx Restart Enable" name="CCP1CON2__PWMRSEN">
         <value caption="ASEVT must be cleared in software to resume PWM activity" name="" value="0x0" />
         <value caption="ASEVT bit clears automatically at the beginning of next PWM period, after shutdown input has ended" name="" value="0x1" />
      </value-group>
      <value-group caption="CCPx Output Enable Synchronization" name="CCP1CON2__OENSYNC">
         <value caption="Update by output enable bits occurs immediately" name="" value="0x0" />
         <value caption="Update by output enable bits occurs on the next Time Base Reset or Rollover" name="" value="0x1" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP1CON2__ICS">
         <value caption="ICM1 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
		 <value caption="Comparator 2 Output" name="" value="0x2" />
		 <value caption="CLC1 Output" name="" value="0x4" />
		 <value caption="CLC2 Output" name="" value="0x5" />
      </value-group>
      <value-group caption="PWMx Output Pins OCxA, OCxC, OCxE Shutdown State Conttrol" name="CCP1CON3__PSSACE">
         <value caption="Pins are in high impedance state" name="" value="0x0" />
         <value caption="Pins are driven inactive" name="" value="0x2" />
         <value caption="Pins are driven active" name="" value="0x3" />
      </value-group>
      <value-group caption="PWMx Output Pins OCxA, OCxC, OCxE Polarity Conttrol" name="CCP1CON3__POLACE">
         <value caption="Output pin polarity is active-high" name="" value="0x0" />
         <value caption="Output pin polarity is active-low" name="" value="0x1" />
      </value-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP2CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC1 output" name="" value="0x3" />
		 <value caption="Reserved" name="" value="0x4" />
		 <value caption="Reserved" name="" value="0x5" />
		 <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
		 <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP3CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC2 output" name="" value="0x3" />
		 <value caption="Reserved" name="" value="0x4" />
		 <value caption="Reserved" name="" value="0x5" />
		 <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
		 <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP2CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="SCCP3 output" name="" value="0x8" />
		 <value caption="MCCP1 output" name="" value="0x10" />
		 <value caption="CLC1 output" name="" value="0x20" />
		 <value caption="OCFA pin (remappable)" name="" value="0x40" />
		 <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP3CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="SCCP2 output" name="" value="0x8" />
		 <value caption="MCCP1 output" name="" value="0x10" />
		 <value caption="CLC2 output" name="" value="0x20" />
		 <value caption="OCFA pin (remappable)" name="" value="0x40" />
		 <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP2CON2__ICS">
         <value caption="ICM2 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
		 <value caption="Comparator 2 Output" name="" value="0x2" />
		 <value caption="CLC1 Output" name="" value="0x4" />
		 <value caption="CLC2 Output" name="" value="0x5" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP3CON2__ICS">
         <value caption="ICM3 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
		 <value caption="Comparator 2 Output" name="" value="0x2" />
		 <value caption="CLC1 Output" name="" value="0x4" />
		 <value caption="CLC2 Output" name="" value="0x5" />
      </value-group>
   </module>
   <module caption="" id="01445" name="CDAC" version="">
      <register-group name="CDAC">
         <register caption="CDAC Control Register" name="DAC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Reference Source Select" mask="0x00000003" name="REFSEL" values="DAC1CON__REFSEL" />
            <bitfield caption="CDAC Output Enable" mask="0x00000100" name="DACOE" values="DAC1CON__DACOE" />
            <bitfield caption="CDAC Enable" mask="0x00008000" name="ON" values="DAC1CON__ON" />
            <bitfield caption="Data Input Register Bits for the CDAC" mask="0xFFFF0000" name="DACDAT" />
         </register>
      </register-group>
