Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0032GPL028.atdf
         <register caption="" name="IPC2" offset="0x8cf0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CNAIS" />
            <bitfield caption="" mask="0x0000001C" name="CNAIP" />
            <bitfield caption="" mask="0x00000300" name="CNBIS" />
            <bitfield caption="" mask="0x00001C00" name="CNBIP" />
            <bitfield caption="" mask="0x00030000" name="CNCIS" />
            <bitfield caption="" mask="0x001C0000" name="CNCIP" />
            <bitfield caption="" mask="0x03000000" name="T1IS" />
            <bitfield caption="" mask="0x1C000000" name="T1IP" />
         </register>
         <register caption="" name="IPC3" offset="0x8d00" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CMP1IS" />
            <bitfield caption="" mask="0x0000001C" name="CMP1IP" />
            <bitfield caption="" mask="0x00000300" name="CMP2IS" />
            <bitfield caption="" mask="0x00001C00" name="CMP2IP" />
            <bitfield caption="" mask="0x00030000" name="RTCCIS" />
            <bitfield caption="" mask="0x001C0000" name="RTCCIP" />
            <bitfield caption="" mask="0x03000000" name="AD1IS" />
            <bitfield caption="" mask="0x1C000000" name="AD1IP" />
         </register>
         <register caption="" name="IPC4" offset="0x8d10" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CRCIS" />
            <bitfield caption="" mask="0x0000001C" name="CRCIP" />
            <bitfield caption="" mask="0x00000300" name="LVDIS" />
            <bitfield caption="" mask="0x00001C00" name="LVDIP" />
            <bitfield caption="" mask="0x00030000" name="CLC1IS" />
            <bitfield caption="" mask="0x001C0000" name="CLC1IP" />
            <bitfield caption="" mask="0x03000000" name="CLC2IS" />
            <bitfield caption="" mask="0x1C000000" name="CLC2IP" />
         </register>
         <register caption="" name="IPC5" offset="0x8d20" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="SPI1EIS" />
            <bitfield caption="" mask="0x0000001C" name="SPI1EIP" />
            <bitfield caption="" mask="0x00000300" name="SPI1TXIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI1TXIP" />
            <bitfield caption="" mask="0x00030000" name="SPI1RXIS" />
            <bitfield caption="" mask="0x001C0000" name="SPI1RXIP" />
            <bitfield caption="" mask="0x03000000" name="U1RXIS" />
            <bitfield caption="" mask="0x1C000000" name="U1RXIP" />
         </register>
         <register caption="" name="IPC6" offset="0x8d30" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="U1TXIS" />
            <bitfield caption="" mask="0x0000001C" name="U1TXIP" />
            <bitfield caption="" mask="0x00000300" name="U1EIS" />
            <bitfield caption="" mask="0x00001C00" name="U1EIP" />
         </register>
         <register caption="" name="IPC7" offset="0x8d40" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="CCP1IS" />
            <bitfield caption="" mask="0x00001C00" name="CCP1IP" />
            <bitfield caption="" mask="0x00030000" name="CCT1IS" />
            <bitfield caption="" mask="0x001C0000" name="CCT1IP" />
            <bitfield caption="" mask="0x03000000" name="CCP2IS" />
            <bitfield caption="" mask="0x1C000000" name="CCP2IP" />
         </register>
         <register caption="" name="IPC8" offset="0x8d50" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CCT2IS" />
            <bitfield caption="" mask="0x0000001C" name="CCT2IP" />
            <bitfield caption="" mask="0x00000300" name="CCP3IS" />
            <bitfield caption="" mask="0x00001C00" name="CCP3IP" />
            <bitfield caption="" mask="0x00030000" name="CCT3IS" />
            <bitfield caption="" mask="0x001C0000" name="CCT3IP" />
         </register>
         <register caption="" name="IPC9" offset="0x8d60" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="SPI2EIS" />
            <bitfield caption="" mask="0x00001C00" name="SPI2EIP" />
            <bitfield caption="" mask="0x00030000" name="SPI2TXIS" />
            <bitfield caption="" mask="0x001C0000" name="SPI2TXIP" />
            <bitfield caption="" mask="0x03000000" name="SPI2RXIS" />
            <bitfield caption="" mask="0x1C000000" name="SPI2RXIP" />
         </register>
         <register caption="" name="IPC10" offset="0x8d70" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="U2RXIS" />
            <bitfield caption="" mask="0x0000001C" name="U2RXIP" />
            <bitfield caption="" mask="0x00000300" name="U2TXIS" />
            <bitfield caption="" mask="0x00001C00" name="U2TXIP" />
            <bitfield caption="" mask="0x00030000" name="U2EIS" />
            <bitfield caption="" mask="0x001C0000" name="U2EIP" />
         </register>
         <register caption="" name="IPC11" offset="0x8d80" rw="RW" size="4">
            <bitfield caption="" mask="0x00030000" name="NVMIS" />
            <bitfield caption="" mask="0x001C0000" name="NVMIP" />
            <bitfield caption="" mask="0x03000000" name="CPCIS" />
            <bitfield caption="" mask="0x1C000000" name="CPCIP" />
         </register>
         <register caption="" name="IPC12" offset="0x8d90" rw="RW" size="4">
            <bitfield caption="" mask="0x00000300" name="ECCSBEIS" />
            <bitfield caption="" mask="0x00001C00" name="ECCSBEIP" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
