Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0032GPL028.atdf
      <value-group caption="Framing Error Status bit (read-only)" name="U2STA__FERR">
         <value caption="Framing error has been detected for the current character" name="" value="0x1" />
         <value caption="Framing error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity Error Status bit (read-only)" name="U2STA__PERR">
         <value caption="Parity error has been detected for the current character" name="" value="0x1" />
         <value caption="Parity error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Idle bit (read-only)" name="U2STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1" />
         <value caption="Data is being received" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U2STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected, this control bit has no effect" name="" value="0x1" />
         <value caption="Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U2STA__URXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1" />
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U2STA__TRMT">
         <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1" />
         <value caption="Transmit shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U2STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full, at least one more character can be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Enable bit" name="U2STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U2STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U2STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U2STA__UTXINV">
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1" />
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U2STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2" />
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1" />
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Address Match Mask bits" name="U2STA__MASK">
         <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0xff" />
         <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0" />
      </value-group>
      <value-group caption="Baud Rate Generator" name="U1BRG__BRG">
         <value caption="Divisor value is 1" name="" value="0x1" />
      </value-group>
      <value-group caption="Baud Rate Generator" name="U2BRG__BRG">
         <value caption="Divisor value is 1" name="" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02610" name="UDID" version="">
      <register-group name="UDID">
         <register caption="" name="UDID1" offset="0x0" rw="R" size="4" />
         <register caption="" name="UDID2" offset="0x4" rw="R" size="4" />
         <register caption="" name="UDID3" offset="0x8" rw="R" size="4" />
         <register caption="" name="UDID4" offset="0xc" rw="R" size="4" />
         <register caption="" name="UDID5" offset="0x10" rw="R" size="4" />
      </register-group>
   </module>
   <module caption="" id="02674" name="WDT" version="">
      <register-group name="WDT">
         <register caption="Watchdog Timer Control Register" name="WDTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000001" name="WDTWINEN" values="WDTCON__WDTWINEN" />
            <bitfield caption="" mask="0x0000003E" name="SLPDIV" />
            <bitfield caption="" mask="0x000000C0" name="CLKSEL" />
            <bitfield caption="Watchdog Timer Postscaler Value in Run Mode bits" mask="0x00001F00" name="RUNDIV" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON" />
            <bitfield caption="Watchdog Timer Clear Key bits" mask="0xFFFF0000" name="WDTCLRKEY" />
         </register>
      </register-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
         <value caption="Enable windowed Watchdog Timer" name="" value="0x1" />
         <value caption="Disable windowed Watchdog Timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
         <value caption="The WDT module is enabled" name="" value="0x1" />
         <value caption="The WDT module is disabled" name="" value="0x0" />
      </value-group>
   </module>
</modules>
</avr-tools-device-file>
